In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
titanic_df = pd.read_excel(r"D:\Python Folder\Titanic.xlsx")

# Display the first few rows
print(titanic_df.head())

  pclass  survived                                             name      age  \
0    1st         1                     Allen, Miss Elisabeth Walton  29.0000
1    1st         0                      Allison, Miss Helen Loraine   2.0000
2    1st         0              Allison, Mr Hudson Joshua Creighton  30.0000
3    1st         0  Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)  25.0000
4    1st         1                    Allison, Master Hudson Trevor   0.9167

      embarked                        home.dest room      ticket  boat  gender
0  Southampton                     St Louis, MO  B-5  24160 L221     2  female
1  Southampton  Montreal, PQ / Chesterville, ON  C26         NaN   NaN  female
2  Southampton  Montreal, PQ / Chesterville, ON  C26         NaN  -135    male
3  Southampton  Montreal, PQ / Chesterville, ON  C26         NaN   NaN  female
4  Southampton  Montreal, PQ / Chesterville, ON  C22         NaN    11    male

In [6]:
titanic_df

,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,gender
0,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,-135,male
3,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
4,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male
...,...,...,...,...,...,...,...,...,...,...
1308,3rd,0,"Zakarian, Mr Artun",NaN,NaN,NaN,NaN,NaN,NaN,male
1309,3rd,0,"Zakarian, Mr Maprieder",NaN,NaN,NaN,NaN,NaN,NaN,male
1310,3rd,0,"Zenn, Mr Philip",NaN,NaN,NaN,NaN,NaN,NaN,male
1311,3rd,0,"Zievens, Rene",NaN,NaN,NaN,NaN,NaN,NaN,female
1312,3rd,0,"Zimmerman, Leo",NaN,NaN,NaN,NaN,NaN,NaN,male

In [7]:
grouped = titanic_df.groupby(['gender'])
print(grouped.groups)  # Shows group labels and their indices

{'female': [0, 1, 3, 6, 8, 11, 12, 15, 19, 23, 27, 28, 30, 31, 36, 37, 38, 41, 42, 48, 49, 52, 54, 56, 58, 59, 61, 64, 67, 69, 70, 73, 74, 76, 80, 81, 83, 85, 87, 89, 91, 93, 94, 95, 96, 99, 101, 102, 104, 107, 109, 111, 113, 115, 116, 118, 122, 123, 124, 128, 130, 132, 135, 136, 140, 141, 142, 144, 147, 149, 155, 157, 159, 162, 163, 164, 167, 169, 173, 178, 180, 182, 188, 189, 190, 194, 200, 202, 205, 208, 212, 214, 216, 219, 220, 222, 225, 227, 230, 236, ...], 'male': [2, 4, 5, 7, 9, 10, 13, 14, 16, 17, 18, 20, 21, 22, 24, 25, 26, 29, 32, 33, 34, 35, 39, 40, 43, 44, 45, 46, 47, 50, 51, 53, 55, 57, 60, 62, 63, 65, 66, 68, 71, 72, 75, 77, 78, 79, 82, 84, 86, 88, 90, 92, 97, 98, 100, 103, 105, 106, 108, 110, 112, 114, 117, 119, 120, 121, 125, 126, 127, 129, 131, 133, 134, 137, 138, 139, 143, 145, 146, 148, 150, 151, 152, 153, 154, 156, 158, 160, 161, 165, 166, 168, 170, 171, 172, 174, 175, 176, 177, 179, ...]}

In [8]:
grouped = titanic_df.groupby(['age'])
print(grouped.groups)  # Shows group labels and their indices

{0.1667: [763], 0.3333: [751], 0.8333: [358, 544, 616], 0.9167: [4], 1.0: [339, 425, 478, 762], 2.0: [1, 491, 512, 537, 585, 627], 3.0: [479, 514, 546, 644, 657, 737], 4.0: [86, 338, 584, 633], 5.0: [642, 647, 794], 6.0: [242, 428, 626, 677, 830], 7.0: [433], 8.0: [376, 384, 397, 538], 9.0: [630, 643, 680, 738, 808, 821, 828], 10.0: [829], 11.0: [50, 632, 831], 12.0: [340, 578], 13.0: [221, 501, 603, 645], 14.0: [49, 564, 826], 15.0: [169, 347, 664], 16.0: [140, 164, 413, 604, 606, 710, 788, 810, 817, 827], 17.0: [83, 202, 263, 455, 621, 628, 651, 700, 742, 757], 18.0: [201, 220, 236, 258, 324, 329, 386, 391, 393, 442, 511, 553, 601, 608, 615, 637, 661, 666, 675, 685, 695, 696, 720, 787, 807], 19.0: [11, 23, 100, 122, 190, 335, 342, 361, 402, 494, 502, 516, 669, 694, 722, 734, 740, 746, 771, 777, 838], 20.0: [282, 350, 380, 496, 518, 528, 554, 609, 618, 623, 634, 654, 672, 686, 693, 721, 835], 21.0: [128, 167, 222, 275, 285, 382, 401, 417, 441, 445, 450, 531, 549, 674, 692, 701, 702, 703, 715, 756, 806], 22.0: [31, 109, 115, 194, 198, 377, 389, 418, 465, 477, 521, 559, 566, 572, 668, 671, 689, 690, 729, 745, 755, 785, 816], 23.0: [93, 102, 125, 189, 239, 330, 343, 400, 424, 444, 462, 543, 576, 617, 646, 650, 653, 769, 780, 784], 24.0: [16, 99, 136, 235, 238, 373, 412, 416, 434, 435, 523, 599, 613, 638, 706, 714, 723, 724, 754, 779, 782, 783], 25.0: [3, 21, 22, 127, 351, 353, 390, 483, 545, 552, 561, 563, 607, 619, 636, 753, 764, 813], 26.0: [20, 64, 344, 356, 357, 414, 473, 476, 515, 596, 611, 631, 635, 663, 670, 676, 684, 719, 760, 770], 27.0: [57, 63, 78, 80, 87, 214, 281, 346, 372, 493, 568, 570, 652, 667, 733, 752], 28.0: [24, 101, 177, 195, 232, 323, 332, 336, 385, 388, 427, 525, 542, 575, 581, 709, 712, 750, 837], 29.0: [0, 166, 369, 371, 519, 569, 583, 688, 718, 747], 30.0: [2, 27, 98, 168, 170, 322, 365, 366, 378, 421, 423, 429, 472, 495, 503, 541, 555, 557, 571, 574, 598, 610, 699, 728, 735, 748, 767, 778], 31.0: [58, 79, 82, 188, 209, 266, 278, 359, 375, 471, 726, 727], 32.0: [245, 309, 327, 334, 392, 440, 510, 513, 532, 582, 593, 622, 655, 673, 682, 717, 776, 833], 33.0: [44, 180, 212, 316, 454, 536, 589, 656, 707, 708, 761, 819], 34.0: [226, 326, 341, 396, 420, 439, 463, 475, 533, 540, 749], 35.0: [113, 144, 145, 147, 374, 409, 410, 558, 573, 605, 620, 639, 691, 732], 36.0: [17, 43, 47, 48, 53, 74, 95, 132, 176, 186, 228, 288, 331, 337, 352, 449, 539, 580, 588, 725, 736, 765, 766], 37.0: [18, 68, 112, 182, 711, 836], 38.0: [76, 121, 146, 406, 408, 411, 629, 641, 697, 823], 39.0: [7, 26, 69, 75, 92, 230, 257, 262, 520, 624, 625], 40.0: [157, 227, 241, 306, 349, 529, 579, 612, 640, 662, 681, 824, 832], 41.0: [33, 154, 451, 500, 562, 614, 822], 42.0: [143, 156, 161, 355, 395, 448, 530, 602, 774], 43.0: [208, 248, 431, 731, 775, 825], 44.0: [36, 108, 141, 181, 363, 426, 741], 45.0: [25, 30, 39, 116, 124, 131, 240, 277, 348, 415, 432, 468, 497, 649, 665, 744, 789], 46.0: [55, 126, 151, 174, 204, 255, 264, 499], 47.0: [5, 10, 19, 56, 114, 185, 269, 793], 48.0: [34, 89, 91, 111, 129, 219, 259, 437, 485, 504, 809], 49.0: [51, 90, 106, 117, 130, 150, 261, 383, 436], 50.0: [15, 88, 149, 163, 229, 279, 280, 422, 527, 547, 565], 51.0: [142, 283, 333], 52.0: [135, 203, 249, 256, 364, 447], 53.0: [41, 94, 443], 54.0: [120, 175, 216, 247, 274, 362, 506], 55.0: [70, 134, 162, 184, 215, 273], 56.0: [205, 231, 233, 234], 57.0: [243, 276, 328, 487], 58.0: [8, 28, 42, 123, 153, 187], 59.0: [37, 556, 739], 60.0: [38, 104, 110, 271, 272], 61.0: [218, 254, 268], 62.0: [246, 251], 63.0: [6, 253], 64.0: [67, 103, 191, 193, 270, 509], 65.0: [179, 772], 67.0: [252], 69.0: [73], 70.0: [72], 71.0: [9, 119, 505]}

In [9]:
titanic_df['survived'].mean()

np.float64(0.341964965727342)

In [10]:
titanic_df['age'].mean()

np.float64(31.19418104265403)

In [11]:
titanic_df.drop(['ticket', 'boat', 'room'],axis=1).head()

,pclass,survived,name,age,embarked,home.dest,gender
0,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",female
1,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",female
2,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",male
3,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",female
4,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",male

In [14]:
# Group by 'gender' and count the number of passengers in each group
gender_count = titanic_df.groupby('gender').size()

print(gender_count)

gender
female    463
male      850
dtype: int64